01_Dummy_cases/02_A02_Rotor/03_MRF_compressible_BC_profile/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

#include "initialConditions"

//$epsilonfarfield

internalField uniform $epsilonfarfield;//3e8

boundaryField
{

    "(HUB|SHROUD|BLADE)"
    {
	#if #calc "${lowRE} == 1"
		//Low RE
        	type            epsilonWallFunction;
        	value           uniform $epsilonfarfield;

	#else 
		//High Re
        	type            epsilonWallFunction;
        	value           uniform $epsilonfarfield;
	#endif
    }
    
    INLET
    {
        type            fixedValue;
        value           uniform $epsilonfarfield;
    }

    OUTLET
    {
	type zeroGradient;

	/*
    	  type            inletOutlet;
          inletValue      $internalField;
          value           $internalField;
	*/
    }
    
    "(PER_1|PER_2)"
    {
        type cyclicAMI;
    }

}


// ************************************************************************* //
