01_Dummy_cases/02_A02_Rotor/03_MRF_compressible_BC_profile/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "pcorr.*"
    {
        solver          GAMG;
        smoother        DICGaussSeidel;
        tolerance       0.1;
        relTol          0;
    }

    p
    {
        solver GAMG;
        tolerance 1e-6;
        relTol 0.01;
        smoother GaussSeidel;
        nPreSweeps 0;
        nPostSweeps 2;
        cacheAgglomeration on;
        agglomerator faceAreaPair;
        nCellsInCoarsestLevel 1000;
        mergeLevels 1;
    }

    pFinal
    {
        $p;
        relTol          0.01;
    }

    Phi
    {
        $p;
        relTol                         0;
        tolerance                      1e-6;
    }

    "(rho|U|e|k|epsilon|omega|Urel|h)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-06;
        relTol          0.1;
    }

    "(rho|U|e|k|epsilon|omega|Urel|h)Final"
    {
        $U;
        relTol          0;
    }
    
    yPsi
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-5;
        relTol          0;
    }
}

PIMPLE
{
    momentumPredictor yes;
    nOuterCorrectors 3;
    nCorrectors     2;
    nNonOrthogonalCorrectors 3;
}


PIMPLE
{
    momentumPredictor   yes;
    transonic           no;
    nOuterCorrectors    3;
    nCorrectors         1;
    nNonOrthogonalCorrectors 3;
    consistent          no;
    simpleRho           yes;

    outerCorrectorResidualControl
    {
        "(U|k|epsilon|omega|Urel)"
        {
            relTol          0;
            tolerance       0.0001;
        }
    }

    turbOnFinalIterOnly no;
}

SIMPLE
{
    nNonOrthogonalCorrectors 2;
    consistent      no;

    residualControl
    {
        U                   1e-6;
        Urel                1e-6;
        p                   1e-5;
        "(k|epsilon|omega)" 1e-5;
    }
}

residualControl
{
    U 1e-5;
    Urel 1e-5;
    p 1e-5;
    "(k|epsilon|omega)" 1e-5;
}

relaxationFactors
{
    fields
    {
        p               0.3; //0.7
        rho             0.01; 
    }
    equations
    {
        U                  0.3; //0.5
	    h		           0.3;
        "(k|epsilon|omega)" 0.3; //0.5
	
    }
}

potentialFlow
{
    nNonOrthogonalCorrectors           20;
}


// ************************************************************************* //
